products_reviews_app_api/app/controllers/reviews_controller.rb

SELECT "reviews".* FROM "reviews" WHERE "reviews"."product_id" = $1  [["product_id", 1]]
---
  def index
    reviews = Review.where(product_id: params[:product_id])

INSERT INTO "reviews" ("title", "content", "author", "created_at", "updated_at", "product_id") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"
---
  def create
    review = Review.new(review_params)
    review.product_id = params[:product_id]

    if review.save

UPDATE "reviews" SET "content" = $1, "author" = $2, "updated_at" = $3 WHERE "reviews"."id" = $4  [["content", "I hated it. "], ["author", "TesterThomas"], ["updated_at", "2020-08-06 02:26:56.471203"], ["id", 1]]
---
  def update
    if @review.update(review_params)